/****************************************Copyright (c)**************************************************
**                               Guangzhou ZHIYUAN electronics Co.,LTD.
**                                     
**                                 http://www.embedtools.com
**
**--------------File Info-------------------------------------------------------------------------------
** File Name:          Xmodem.h
** Last modified Date: 2008.08.21
** Last Version:       v1.0
** Description:        Xmodem的头文件
** 
**------------------------------------------------------------------------------------------------------
** Created By:         Weng Heiwei
** Created date:       2008.08.20
** Version:            v1.0
** Descriptions:
**
********************************************************************************************************/
#ifndef __XMODEM_H__
#define __XMODEM_H__

#ifdef __cplusplus
  extern "C" {
#endif

#ifndef TRUE
#define TRUE  1
#endif

#ifndef FALSE
#define FALSE 0
#endif

#ifndef NULL
#define NULL  0
#endif

typedef unsigned char  uint8;                   /* 无符号8位整型变量  */
typedef signed   char  int8;                    /* 有符号8位整型变量  */
typedef unsigned short uint16;                  /* 无符号16位整型变量 */
typedef signed   short int16;                   /* 有符号16位整型变量 */
typedef unsigned int   uint32;                  /* 无符号32位整型变量 */
typedef signed   int   int32;                   /* 有符号32位整型变量 */
typedef float          fp32;                    /* 单精度浮点数（32位长度） */
typedef double         fp64;                    /* 双精度浮点数（64位长度） */

/*********************************************************************************************************
 定义Xmodem的控制字符
*********************************************************************************************************/
#define SOH 0x01
#define EOT 0x04
#define ACK 0x06
#define NAK 0x15
#define CAN 0x18
  
/*********************************************************************************************************
 定义Xmodem协议的控制常量
*********************************************************************************************************/
#define BLOCK_SIZE 128	
#define ONE_SECOND (SysCtlClockGet())	

/*********************************************************************************************************
 定义Xmodem的数据帧结构
*********************************************************************************************************/
struct Frame
{
	unsigned char blkNum;	                                                /* 数据包序号                   */
	unsigned char blkNumRev;	                                            /* 数据包序号补码               */
	unsigned char dataBlk[BLOCK_SIZE];	                                  /* 数据区                       */
	unsigned char checkSum;	                                              /* 累加校验和                   */
};

/*********************************************************************************************************
** 函数名称: XmodemRun
** 功能描述: Xmodem协议传输函数
** 入口参数: ptr           Xmodem帧数据接收缓冲区
** 出口参数: true          通信成功
**           false         发送方中止通信 
*********************************************************************************************************/
extern uint8 XmodemRun(char* file_name);	

/*********************************************************************************************************
** 函数名称: RecFrame
** 功能描述: 接受XMODEM的一帧数据
** 入口参数: oneFrame      帧数据结构变量的地址
**           preblkNum     预测的包号
** 出口参数: 0             接收的帧数据正确
**           1             接收的帧数据错误
*********************************************************************************************************/
static int RecFrame(struct Frame* oneFrame,uint8 preblkNum);	

/*********************************************************************************************************
** 函数名称: MemCpy
** 功能描述: 数据拷贝函数
** 入口参数: des           目的数据缓冲区
**           src           源数据缓冲区
**           length        拷贝的数据长度
** 出口参数: 无
*********************************************************************************************************/
static void MemCpy(char *des, char *src, int length); 

/*********************************************************************************************************
** 函数名称: CheckSum
** 功能描述: 求累加校验和
** 入口参数: oneFrame      Xmodem帧结构数据
** 出口参数: Xmodem数据区的累加校验和
*********************************************************************************************************/
static unsigned char CheckSum(struct Frame* oneFrame);

#ifdef __cplusplus
}
#endif

#endif
